/*
* codemasters f1 dashboard test

gcc -o /opt/mfcc-ac clients/assetto_corsa/ac-cli.c -lrt -std=c11
*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <unistd.h>
#include <fcntl.h>
#include <poll.h>
#include <arpa/inet.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <signal.h>
#include <sys/time.h>

#include <getopt.h>
#include <math.h>

#include <extras.h>
//from https://docs.google.com/document/d/1KfkZiIluXZ6mMhLWfDX1qAGbvhGRC3ZUzjVIt5FQpp4/pub

#if 0
struct RTCarInfo
{
int identifier; //char identifier;  //0
int size;                           //4
float speed_Kmh;                    //8
float speed_Mph;                    //12
float speed_Ms;                     //16
bool isAbsEnabled;                  //20
bool isAbsInAction;                 //21
bool isTcInAction;                  //22
bool isTcEnabled;                   //23
bool isInPit;                       //24
bool isEngineLimiterOn;             //25
float accG_vertical;                //26
float accG_horizontal;              //30
float accG_frontal;                 //34
int lapTime;                        //38
int lastLap;
int bestLap;
int lapCount;
float gas;
float brake;
float clutch;
float engineRPM;
float steer;
int gear;
float cgHeight;
float wheelAngularSpeed[4];
float slipAngle[4];
float slipAngle_ContactPatch[4];
float slipRatio[4];
float tyreSlip[4];
float ndSlip[4];
float load[4];
float Dy[4];
float Mz[4];
float tyreDirtyLevel[4];
float camberRAD[4];
float tyreRadius[4];
float tyreLoadedRadius[4];
float suspensionHeight[4];
float carPositionNormalized;
float carSlope;
float carCoordinates[3];

}

struct RTLap
{
int carIdentifierNumber;
int lap;
char driverName[50];
char carName[50];
int time;

};

struct handshackerResponse{
char carName[50];
char driverName[50];
int identifier;
int version;
char trackName[50];
char trackConfig[50];

}
#endif
#define bool unsigned char
struct RTCarInfo
{
        char identifier;
        int size;

        float speed_Kmh;
        float speed_Mph;
        float speed_Ms;

        bool isAbsEnabled;
