/*
* codemasters dirt rally 2
*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <unistd.h>
#include <fcntl.h>
#include <poll.h>
#include <arpa/inet.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <signal.h>
#include <sys/time.h>


#include <getopt.h>
#include <math.h>

#include <extras.h>
/*
Pitch is the tilt of the car forwards or backwards in [°]
Roll is how much the car is dipped to the left or right in [°]
Yaw is the heading of the car (north, east, south, west) in [°]

Surge means the acceleration of the car in longitudinal direction (front/back) [g]
Sway means the acceleration of the car in lateral direction (left/right) [g]
Heave means the acceleration up and down [g]


class model from: https://github.com/lmirel/dr2_logger/blob/master/source/dirt_rally/udp_data.py
class Fields(Enum):
    run_time =            0
    lap_time =            1
    distance =            2
    progress =            3
    pos_x =               4
    pos_y =               5
    pos_z =               6
    speed_ms =            7
    vel_x =               8
    vel_y =               9
    vel_z =               10
    roll_x =              11
    roll_y =              12
    roll_z =              13
    pitch_x =             14
    pitch_y =             15
    pitch_z =             16
    susp_rl =             17
    susp_rr =             18
    susp_fl =             19
    susp_fr =             20
    susp_vel_rl =         21
    susp_vel_rr =         22
    susp_vel_fl =         23
    susp_vel_fr =         24
    wsp_rl =              25
    wsp_rr =              26
    wsp_fl =              27
    wsp_fr =              28
    throttle =            29
    steering =            30
    brakes =              31
    clutch =              32
    gear =                33
    g_force_lat =         34
    g_force_lon =         35
    current_lap =         36
    rpm =                 37  # / 10
    sli_pro_support =     38  # ignored
    car_pos =             39
    kers_level =          40  # ignored
    kers_max_level =      41  # ignored
    drs =                 42  # ignored
    traction_control =    43  # ignored
    anti_lock_brakes =    44  # ignored
    fuel_in_tank =        45  # ignored
    fuel_capacity =       46  # ignored
    in_pit =              47  # ignored
    sector =              48
    sector_1_time =       49
    sector_2_time =       50
    brakes_temp_rl =      51
    brakes_temp_rr =      52
    brakes_temp_fl =      53
    brakes_temp_fr =      54
    tyre_pressure_rl =    55  # ignored
    tyre_pressure_rr =    56  # ignored
    tyre_pressure_fl =    57  # ignored
    tyre_pressure_fr =    58  # ignored
    laps_completed =      59
    total_laps =          60
    track_length =        61
    last_lap_time =       62
    max_rpm =             63  # / 10
    idle_rpm =            64  # / 10
    max_gears =           65


num_fields = 66
*/


#define PACKED __attribute__((packed))

typedef struct PACKED {
  float     run_time ; //            0
  float     lap_time ; //            1
  float     distance ; //            2
  float     progress ; //            3
  float     pos_x ; //               4
  float     pos_y ; //               5
  float     pos_z ; //               6
  float     speed_ms ; //            7
  float     vel_x ; //               8
  float     vel_y ; //               9
  float     vel_z ; //               10
  float     roll_x ; //              11
  float     roll_y ; //              12
  float     roll_z ; //              13
  float     pitch_x ; //             14
  float     pitch_y ; //             15
  float     pitch_z ; //             16
  float     susp_rl ; //             17
  float     susp_rr ; //             18
  float     susp_fl ; //             19
  float     susp_fr ; //             20
  float     susp_vel_rl ; //         21
  float     susp_vel_rr ; //         22
  float     susp_vel_fl ; //         23
  float     susp_vel_fr ; //         24
  float     wsp_rl ; //              25
  float     wsp_rr ; //              26
  float     wsp_fl ; //              27
  float     wsp_fr ; //              28
  float     throttle ; //            29
  float     steering ; //            30
  float     brakes ; //              31
  float     clutch ; //              32
  float     gear ; //                33
  float     g_force_lat ; //         34
  float     g_force_lon ; //         35
  float     current_lap ; //         36
  float     rpm ; //                 37  # / 10
  float     sli_pro_support ; //     38  # ignored
  float     car_pos ; //             39
  float     kers_level ; //          40  # ignored
  float     kers_max_level ; //      41  # ignored
  float     drs ; //                 42  # ignored
  float     traction_control ; //    43  # ignored
  float     anti_lock_brakes ; //    44  # ignored
  float     fuel_in_tank ; //        45  # ignored
  float     fuel_capacity ; //       46  # ignored
  float     in_pit ; //              47  # ignored
  float     sector ; //              48
  float     sector_1_time ; //       49
  float     sector_2_time ; //       50
  float     brakes_temp_rl ; //      51
  float     brakes_temp_rr ; //      52
  float     brakes_temp_fl ; //      53
  float     brakes_temp_fr ; //      54
  float     tyre_pressure_rl ; //    55  # ignored
  float     tyre_pressure_rr ; //    56  # ignored
  float     tyre_pressure_fl ; //    57  # ignored
  float     tyre_pressure_fr ; //    58  # ignored
  float     laps_completed ; //      59
  float     total_laps ; //          60
  float     track_length ; //        61
  float     last_lap_time ; //       62
  float     max_rpm ; //             63  # / 10
  float     idle_rpm ; //            64  # / 10
  float     max_gears ; //           65
  //float num_fields ; // 66
} UDPPacket;


#if 0

struct UDPPacket
{
    float m_time;
    float m_lapTime;
    float m_lapDistance;
    float m_totalDistance;
    float m_x;      // World space position
    float m_y;      // World space position
    float m_z;      // World space position
    float m_speed;
    float m_xv;      // Velocity in world space
    float m_yv;      // Velocity in world space
    float m_zv;      // Velocity in world space
    float m_xr;      // World space right direction
    float m_yr;      // World space right direction
    float m_zr;      // World space right direction
    float m_xd;      // World space forward direction
    float m_yd;      // World space forward direction
    float m_zd;      // World space forward direction
    float m_susp_pos_bl;
    float m_susp_pos_br;
    float m_susp_pos_fl;
    float m_susp_pos_fr;
    float m_susp_vel_bl;
    float m_susp_vel_br;
    float m_susp_vel_fl;
